
#[🇰🇷韓.代工]幾何菱形貝殼鋯石耳釘套裝 - 几何贝壳耳钉套装 × 3=TWD$246 (成本單價82)
a = 82


#[🇰🇷韓.代工]冷淡風圓形鋯石開口戒指 - 波浪开口戒指 × 5=TWD$235 (成本單價47)
b = 47


#[925純銀]設計感月光石耳環YC6059E - 月光石耳钉-白金色, 925银 × 3=195 (成本單價65)
c = 65


#[925純銀]設計感月光石耳環YC6059E - 月光石耳钉-玫瑰金, 925银 × 3=195 (成本單價65)
d = 65


#[925純銀]貓眼石幾何耳釘 × 3=429 (成本單價143)
e = 143


#[925純銀]簡約圓圈耳環 - 開口圈7mm, 925銀 × 3=75 (成本單價25)
f = 25


#[🇰🇷韓.代工]設計師款滾筒手鏈 - 简约滚筒手链 × 3=225 (成本單價75)
g = 75


#氣質優雅珍珠盤髪抓夾 - 扭花全鉆 × 3=99(成本單價33)
h = 33

#氣質優雅珍珠盤髪抓夾 - 鉆珍珠扭花 × 3=99(成本單價33)
i = 33


#[銅]麻花镂空開口戒指 - A769, 开口可调节 × 3=126單價(成本單價42)
j = 42


#[銅]鋯石麻花鏤空戒指 - 307 × 3=138單價(成本單價46)
k = 46


#[925純銀]H字母小鑽手鏈 - 字母H手链-黄金色, 925银 × 4=420單價(成本單價105)
l = 105


#[925純銀]簡約個性雙層超細手鏈 - 黃金色, 925銀 × 3=435(成本單價145)
m = 145


#[925純銀]簡約個性雙層超細手鏈 - 銀色, 925銀 × 3=435單價(成本單價145)
n = 145


#[316L鈦鋼]高級感圓圈耳環 - 玫瑰金色耳饰一对 × 3=279(成本單價93)
o = 93


#[316L鈦鋼]羅馬帶鉆幸運耳釘項鏈 - 玫瑰金罗马带钻双环项链40+5cm × 2=126(成本單價63)
p = 63


#[316L鈦鋼]羅馬帶鉆幸運耳釘項鏈 - 金色罗马带钻双环项链40+5cm × 2=126(成本單價63)
q = 63


#[925銀針]甜美彩鋯花環耳釘 × 3 TWD$138.00(成本單價46)
r = 46


#[塑膠袋] 耳環項鏈飾品包裝袋 - V013 × 1=63
s = 63



#[塑膠袋] 耳環項鏈飾品包裝袋 - V009 × 1=91
t = 91


#紙包材=TWD$820.00
u = 820



total_stuff_price = a + b + c + d + e + f + g + h + i + j + k + l + m + n + o + p + q + r + s + t
print('所有物品單價總計 = ' + str(total_stuff_price))
#1470


each_stuff_number=(5135-820)/1470

print('每樣物品至少消耗:'+  str(each_stuff_number) + '個')














